In [1]:
people = {
    "first":["samma","soni","saniya"],
    "last":["khatoon","begam","firdous"],
    "email":["sammakhatoon23@gmail.com","sonibegam23@gmail.com", "saniyafirdous456@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)

In [4]:
df

    first     last                       email
0   samma  khatoon    sammakhatoon23@gmail.com
1    soni    begam       sonibegam23@gmail.com
2  saniya  firdous  saniyafirdous456@gmail.com

In [5]:
df['first']+' '+df['last']

0     samma khatoon
1        soni begam
2    saniya firdous
dtype: object

In [6]:
df['full_name']=df['first']+' '+df['last']

In [7]:
df

    first     last                       email       full_name
0   samma  khatoon    sammakhatoon23@gmail.com   samma khatoon
1    soni    begam       sonibegam23@gmail.com      soni begam
2  saniya  firdous  saniyafirdous456@gmail.com  saniya firdous

In [8]:
df.drop(columns=['first','last'],inplace=True)

In [9]:
df

                        email       full_name
0    sammakhatoon23@gmail.com   samma khatoon
1       sonibegam23@gmail.com      soni begam
2  saniyafirdous456@gmail.com  saniya firdous

In [10]:
df['full_name'].str.split(' ')

0     [samma, khatoon]
1        [soni, begam]
2    [saniya, firdous]
Name: full_name, dtype: object

In [11]:
df['full_name'].str.split(' ',expand=True)

        0        1
0   samma  khatoon
1    soni    begam
2  saniya  firdous

In [12]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [13]:
df

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
1       sonibegam23@gmail.com      soni begam    soni    begam
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous

In [14]:
df=pd.concat([df,pd.DataFrame([{'first': 'parvej'}])],ignore_index=True)

In [15]:
df

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
1       sonibegam23@gmail.com      soni begam    soni    begam
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous
3                         NaN             NaN  parvej      NaN

In [16]:
people = {
    "first":["alfiya","asia"],
    "last":["parveen","ali"],
    "email":["alfiyaparveen45@gmail.com","asiaali678@gmail.com"]
}
df2=pd.DataFrame(people)

In [17]:
df2

    first     last                      email
0  alfiya  parveen  alfiyaparveen45@gmail.com
1    asia      ali       asiaali678@gmail.com

In [24]:
df=pd.concat([df,df2],ignore_index=True,sort=False)

In [25]:
df

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
1       sonibegam23@gmail.com      soni begam    soni    begam
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous
3                         NaN             NaN  parvej      NaN
4   alfiyaparveen45@gmail.com             NaN  alfiya  parveen
5        asiaali678@gmail.com             NaN    asia      ali

In [27]:
df.drop(index=5)

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
1       sonibegam23@gmail.com      soni begam    soni    begam
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous
3                         NaN             NaN  parvej      NaN
4   alfiyaparveen45@gmail.com             NaN  alfiya  parveen

In [28]:
filt=df['last']=='begam'
df.drop(index=df[filt].index)

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous
3                         NaN             NaN  parvej      NaN
4   alfiyaparveen45@gmail.com             NaN  alfiya  parveen
5        asiaali678@gmail.com             NaN    asia      ali

In [29]:
df.drop(index=4)

                        email       full_name   first     last
0    sammakhatoon23@gmail.com   samma khatoon   samma  khatoon
1       sonibegam23@gmail.com      soni begam    soni    begam
2  saniyafirdous456@gmail.com  saniya firdous  saniya  firdous
3                         NaN             NaN  parvej      NaN
5        asiaali678@gmail.com             NaN    asia      ali